controllers/SiteController.php

SELECT * FROM `pdrb_pengeluaran_td_2010_adh_berlaku` ORDER BY `id` DESC
SELECT * FROM `pdrb_pengeluaran_td_2010_adh_konstan` WHERE (`tahun`=2017) AND (`triwulan`=1)
SELECT * FROM `distribusi_pdrb_pengeluaran_td_2010_adh_berlaku` WHERE (`tahun`=2017) AND (`triwulan`=1)
SELECT * FROM `pertumbuhan_pdrb_pengeluaran_td_2010_adh_konstan_qtoq` WHERE (`tahun`=2017) AND (`triwulan`=1)
SELECT * FROM `pertumbuhan_pdrb_pengeluaran_td_2010_adh_konstan_ytoy` WHERE (`tahun`=2017) AND (`triwulan`=1)
SELECT * FROM `pertumbuhan_pdrb_pengeluaran_td_2010_adh_konstan_ctoc` WHERE (`tahun`=2017) AND (`triwulan`=1)
SELECT * FROM `indeks_implisit` WHERE (`tahun`=2017) AND (`triwulan`=1)
SELECT * FROM `laju_pertumbuhan_indeks_implisit` WHERE (`tahun`=2017) AND (`triwulan`=1)
---
		    public function actionTabelpokok()
			{
	$input = new \app\models\inputd();
	        if (Yii::$app->request->post()) {
			$th = $_POST['Inputd']['tahun'];
			$tw = $_POST['Inputd']['tw'];
	$tabel1 = \app\models\PdrbPengeluaranTd2010AdhBerlaku::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel2 = \app\models\PdrbPengeluaranTd2010AdhKonstan::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel3 = \app\models\DistribusiPdrbPengeluaranTd2010AdhBerlaku::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel4 = \app\models\PertumbuhanPdrbPengeluaranTd2010AdhKonstanQtoq::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel5 = \app\models\PertumbuhanPdrbPengeluaranTd2010AdhKonstanYtoy::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel6 = \app\models\PertumbuhanPdrbPengeluaranTd2010AdhKonstanCtoc::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel7 = \app\models\IndeksImplisit::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();
	$tabel8 = \app\models\LajuPertumbuhanIndeksImplisit::find()->where(['tahun' => $th,'triwulan' => $tw,])->one();

	        return $this->render('tabel-pokok', [
         'model1' => $tabel1,
         'model2' => $tabel2,
         'model3' => $tabel3,
         'model4' => $tabel4,
         'model5' => $tabel5,
         'model6' => $tabel6,
         'model7' => $tabel7,
         'model8' => $tabel8,
         'input' => $input,
		 'th' => $th,
		 'triwulan' => $tw,
    ]);
}
	$tabel1 = \app\models\PdrbPengeluaranTd2010AdhBerlaku::find()->orderBy('id DESC')->one();
	$tabel2 = \app\models\PdrbPengeluaranTd2010AdhKonstan::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();
	$tabel3 = \app\models\DistribusiPdrbPengeluaranTd2010AdhBerlaku::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();
	$tabel4 = \app\models\PertumbuhanPdrbPengeluaranTd2010AdhKonstanQtoq::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();
	$tabel5 = \app\models\PertumbuhanPdrbPengeluaranTd2010AdhKonstanYtoy::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();
	$tabel6 = \app\models\PertumbuhanPdrbPengeluaranTd2010AdhKonstanCtoc::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();
	$tabel7 = \app\models\IndeksImplisit::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();
	$tabel8 = \app\models\LajuPertumbuhanIndeksImplisit::find()->where(['tahun' => $tabel1->tahun,'triwulan' => $tabel1->triwulan,])->one();

SELECT COUNT(*) FROM `pdrb_pengeluaran_td_2010_adh_berlaku`
SELECT * FROM `pdrb_pengeluaran_td_2010_adh_berlaku` ORDER BY `tahun`, `triwulan` LIMIT 1
---
public function actionDataSeries()
    {
		 $input = new \app\models\inputd();
		$model = new \app\models\tahun();
		$jumlaht = 1;
		$tabelcount = \app\models\PdrbPengeluaranTd2010AdhBerlaku::find()->count();
		$tabel1 = \app\models\PdrbPengeluaranTd2010AdhBerlaku::find()->limit($jumlaht)->offset($tabelcount-$jumlaht)->orderBy([
  'tahun' => SORT_ASC,
  'triwulan'=>SORT_ASC
])->all();