views/site/data-series.php

SELECT * FROM `tahun`
SELECT * FROM `judul`
---

$this->title = 'Data Series';
$this->params['breadcrumbs'][] = $this->title;
$tahun = \app\models\Tahun::find()->all();
$listData=ArrayHelper::map($tahun,'id','tahun');
$judul = \app\models\Judul::find()->all();

SELECT * FROM `judul` WHERE `id` IN (1, 2, 3, 4, 5, 6, 7, 8)
---
        'modules/exporting',
        'themes/grid-light',
    ],
    'options' => [
        'title' => [
            'text' => \app\models\Judul::findOne($judul)->judul,
        ],
        'xAxis' => [
            'categories' => $categoriesListTh,
        ],

        'series' => [
            [
                'type' => 'column',
                'name' => \app\models\Judul::findOne($judul)->judul,
                'data' => $categoriesListNilaiTotal,
            ],


        ],
    ]

SELECT * FROM `judul` WHERE `id` IN (1, 2, 3, 4, 5, 6, 7, 8)
---
        'modules/exporting',
        'themes/grid-light',
    ],
    'options' => [
        'title' => [
            'text' => \app\models\Judul::findOne($judul)->judul,
        ],
        'xAxis' => [
            'categories' => $categoriesListTh,
        ],

        'series' => [
            [
                'type' => 'column',
                'name' => \app\models\Judul::findOne($judul)->judul,
                'data' => $categoriesListNilaiMigas,
            ],

        ],
    ]