views/site/input-fenomena.php

SELECT * FROM `tahun`
---
use yii\widgets\ActiveForm;
$this->title = 'Input Fenomena';
$this->params['breadcrumbs'][] = $this->title;
$tahun = \app\models\Tahun::find()->all();