views/site/tabel-pokok.php


$this->title = 'TABEL PDRB Sektoral';
$this->params['breadcrumbs'][] = $this->title;
$tahun = \app\models\Tahun::find()->all();
---
SELECT * FROM `tahun`